Repository: camiloaa/embdebian-crush
Catalog: po/*.po
Languages: de, fr

source: You must run this from inside a debian source tree (debian/changelog not found)
de: Sie müssen dies innerhalb des Debian-Quellenverzeichnisbaums ausführen (»debian/changelog« nicht gefunden)
fr: Vous devez lancer ce script depuis une arborescence de source Debian (debian/changelog non trouvé)

source: $cfg does not exist!
de: $cfg existiert nicht!
fr: $cfg n'existe pas !

source: Need to create a new pbuilder crossbuilding chroot first.
de: Es muss zuerst eine neue Pbuilder-Cross-Erstellungs-Chroot erstellt werden.
fr: Il est nécessaire de créer d'abord un nouveau chroot de construction croisée pour pbuilder.

source: Use pdebuild-cross-create to create one.
de: Benutzen Sie pdebuild-cross-create, um eine zu erstellen.
fr: Utiliser pdebuild-cross-create pour en créer un.

source: Broken config, no BUILDPLACE set in '$cfg'.
de: Kaputte Konfiguration, in »$cfg« ist BUILDPLACE nicht gesetzt.
fr: Mauvaise configuration, BUILDPLACE non défini dans « $cfg ».

source: $BASETGZ exists! If you want to create a new one, delete or move '$BASETGZ'.
de: $BASETGZ existiert! Falls Sie eine neue erstellen möchten, löschen oder verschieben Sie »$BASETGZ«.
fr: $BASETGZ existe ! Pour en créer un nouveau, supprimer ou déplacer « $BASETGZ ».

source: Otherwise, use 'pbuilder login --configfile /etc/pdebuild-cross/pdebuild-cross.rc --save-after-login'
de: Benutzen Sie andernfalls »pbuilder login --configfile /etc/pdebuild-cross/pdebuild-cross.rc --save-after-login«,
fr: Sinon, utiliser « pbuilder login --configfile /etc/pdebuild-cross/pdebuild-cross.rc --save-after-login »

source: to make changes within the existing $BASETGZ.
de: um Änderungen innerhalb der existierenden $BASETGZ vorzunehmen.
fr: pour appliquer des modifications à $BASETGZ.

source: Enter your sudo password if prompted
de: Geben Sie bei Nachfrage Ihr Sudo-Passwort an.
fr: Entrez votre mot de passe sudo s'il vous est demandé

source: Unknown option
de: unbekannte Option
fr: Option inconnue

source: %s version %s Usage: %s -V|--vendor VENDOR -p|--package PACKAGE -k|--key KEY %s -?|-h|--help|--version Commands: -v|--vendor VENDOR: the vendor name from dpkg-vendor -p|--package PACKAGE: the package name (usually source) -k|--key KEY: arbitrary string for the key of the data All commands need to be specified. On success, the string is printed and %s exits with zero. In the case of error, %s dies with an empty string on STDERR and exits with a non-zero return value.
de: %s-Version %s Aufruf: %s -V|--vendor ANBIETER -p|--package PAKET -k|--key SCHLÜSSEL %s -?|-h|--help|--version Befehle: -v|--vendor ANBIETER: der Anbietername aus Dpkg-vendor -p|--package PAKET: der Paketname (üblicherweise vom Quellpaket) -k|--key SCHLÜSSEL: beliebige Zeichenkette für den Schlüssel der Daten Alle Befehle müssen angegeben werden. Bei Erfolg wird die Zeichenkette ausgegeben und %s endet mit dem Rückgabewert Null. Im Fall eines Fehlers beendet sich %s mit einer leeren Zeichenkette auf STDERR und endet mit einem Rückgabewert ungleich Null.
fr: %s version %s Utilisation : %s -V|--vendor ÉDITEUR -p|--package PAQUET -k|--key CLÉ %s -?|-h|--help|--version Commandes : -v|--vendor ÉDITEUR : le nom de l'éditeur donné par dpkg-vendor -p|--package PAQUET : le nom du paquet (habituellement le paquet source) -k|--key CLÉ : chaîne arbitraire pour la clé des données Toutes les commandes doivent être indiquées. En cas de succès, la chaîne est affichée et %s quitte avec une valeur de retour égale à zéro. En cas d'erreur, %s se termine avec une chaîne vide sur STDERR et quitte avec une valeur de retour différente de zéro.

source: Unknown architecture: %s
de: unbekannte Architektur: %s
fr: Architecture inconnue : %s

source: Unable to find '%s' directory
de: Verzeichnis »%s« kann nicht gefunden werden
fr: Impossible de trouver le répertoire « %s »

source: Please specify a .dsc file
de: Bitte geben Sie eine .dsc-Datei an
fr: Veuillez indiquer un fichier .dsc

source: Cannot read /etc/xapt.d/%s.conf
de: /etc/xapt.d/%s.conf kann nicht gelesen werden.
fr: Impossible de lire /etc/xapt.d/%s.conf

source: Unable to open .dsc file: '%s'
de: .dsc-Datei kann nicht geöffnet werden: »%s«
fr: Impossible d'ouvrir le fichier .dsc : « %s »

source: Checking that build dependencies '%s' for %s are installed.
de: Es wird überprüft, ob Build-Abhängigkeiten »%s« für %s installiert sind.
fr: Vérification de l'installation des dépendances de construction « %s » pour %s.

source: No build dependencies to install for %s
de: keine zu installierenden Abhängigkeiten für %s
fr: Aucune dépendance de construction à installer pour %s

source: %s needs dependencies installed:
de: %s benötigt installierte Abhängigkeiten:
fr: %s nécessite l'installation de dépendances :

source: Architecture limit: [!%s] %s
de: Architekturlimit: [!%s] %s
fr: Limite d'architecture : [!%s] %s

source: No cross dependencies to install for %s
de: keine zu installierenden Cross-Abhängigkeiten für %s
fr: Aucune dépendance croisée à installer pour %s

source: Checking that cross build dependencies '%s' for %s are installed.
de: Es wird überprüft, ob die Cross-Build-Abhängigkeiten »%s« für %s installiert sind.
fr: Vérification de l'installation des dépendances de construction croisée « %s » pour %s.

source: '%s' needs %d cross dependency installed: %s
de: »%s« benötigt %d installierte Cross-Abhängigkeiten: %s
fr: %s nécessite l'installation de %d dépendance croisée : %s

source: Checking Build-Conflict between '%s' and '%s'
de: Build-Konflikt zwischen »%s« und »%s« wird überprüft
fr: Vérification des conflits de construction (« Build-Conflict ») entre « %s » et « %s »

source: %s: Error: Cannot build '%s': build conflict found with '%s'
de: %s: Fehler: »%s« kann nicht erstellt werden: Build-Konflikt mit »%s« gefunden
fr: %s : Erreur : impossible de construire « %s » : conflit de construction avec « %s »

source: Architecture limit: [%s] %s
de: Architekturlimit: [%s] %s
fr: Limite d'architecture : [%s] %s

source: Skipping %s, %s does not match %s
de: %s wird übersprungen, %s entspricht nicht %s
fr: Abandon de %s, %s ne satisfait pas %s

source: Using %s for %s
de: %s wird für %s benutzt
fr: Utilisation de %s pour %s

source: Omitting %s for %s - already selected %s
de: %s wird für %s ausgelassen - %s wurde bereits ausgewählt
fr: Omission de %s pour %s - %s déjà sélectionné

source: Constraint '%s' is a virtual package provided by 'type-handling', omitting %s for %s
de: Beschränkung »%s« ist ein von »type-handling« bereitgestelltes virtuelles Paket, %s wird für %s ausgelassen.
fr: La contrainte « %s » est un paquet virtuel fourni par « type-handling », omission de %s pour %s

source: Constraint '%s' is a virtual package provided by 'type-handling', omitting.
de: Beschränkung »%s« ist ein von »type-handling« bereitgestelltes virtuelles Paket und wird ausgelassen.
fr: La contrainte « %s » est un paquet virtuel fourni par « type-handling », omission.

source: Constraint '%s' is not available, omitting. (This could be a virtual package or a bug.)
de: Beschränkung »%s« ist nicht verfügbar und wird ausgelassen. (Dies könnte ein virtuelles Paket oder ein Fehler sein.)
fr: La contrainte « %s » n'est pas disponible, omission (cela peut être un paquet virtuel ou un bug).

source: %s: Failed to read apt-cache policy for '%s'
de: %s: Das Lesen der Apt-cache-Richtlinie für »%s« ist fehlgeschlagen
fr: %s : Échec de la lecture d'« apt-cache policy %s »

source: Unable to satisfy 'Build-Depends: %s (%s %s)' for %s.
de: »Build-Abhängigkeiten: %s (%s %s)« für %s können nicht erfüllt werden.
fr: Impossible de satisfaire « Build-Depends: %s (%s %s) » pour %s.

source: Latest available version of %s is %s
de: Letzte verfügbare Version von %s ist %s.
fr: La dernière version disponible de %s est %s

source: '%s' does not appear to be available to apt!
de: »%s« scheint nicht für Apt verfügbar zu sein!
fr: « %s » n'est pas disponible pour apt !

source: error occurred while parsing %s
de: Beim Auswerten von %s ist ein Fehler aufgetreten
fr: une erreur est survenue lors de l'analyse (« parsing ») de %s

source: %s version %s Usage: %s [-a|--arch] [-d|--dir] [-q|--quiet] [-n|--dry-run] %s -?|-h|--help|--version Options: -a|--arch: Install cross packages for the specified arch. -d|--dir DIR: Location of the unpacked source (./debian/control) --dsc DSCFILE: Path to a .dsc file for the package. -m|--multiarch: Make dpkg-cross convert Multi-Arch packages. -v|--verbose: Make the output more verbose -q|--quiet: Make the output less verbose -n|--dry-run: Only output the commands which would be used. --use-sudo: Call apt-get using sudo. %s is a simple build dependency checker for cross-building. Native build dependencies are checked using the debian/control file in the source package being built and installed with apt-get. Cross build dependencies are checked using a debian/xcontrol file or the debian/control file if no xcontrol file exists. %s uses xapt to install cross build dependencies.
fr: %s version %s Utilisation : %s [-a|--arch] [-d|--dir] [-q|--quiet] [-n|--dry-run] %s -?|-h|--help|--version Options : -a|--arch: Installe les paquets croisés pour l'architecture indiquée -d|--dir DIR: Emplacement des sources non-empaquetées (./debian/control) --dsc DSCFILE: Chemin d'un fichier .dsc pour le paquet -m|--multiarch: Active la conversion des paquets Multi-Arch par dpkg-cross -v|--verbose: Active la sortie détaillée -q|--quiet: Active la sortie silencieuse -n|--dry-run: Afficher les commandes qui seraient utilisées sans les exécuter --use-sudo: Appelle apt-get en utilisant sudo %s est un simple vérificateur de dépendances de construction pour la construction croisée. Les dépendances de construction natives sont vérifiées en utilisant le fichier debian/control dans le paquet source en cours de construction et d'installation par apt-get. Les dépendances de construction croisée sont vérifiées en utilisant le fichier debian/xcontrol ou le fichier debian/control si le fichier xcontrol n'existe pas. %s utilise xapt pour installer les dépendances de construction croisée.

source: Error: Multi-Arch support needs dpkg-cross (>= %s). Found %s
de: Fehler: Unterstützung für mehrere Architekturen erfordert dpkg-cross (>= %s). Gefunden wurde %s.
fr: Erreur : le support de Multi-Arch nécessite dpkg-cross (>= %s). %s trouvée

source: %s: Illogical options set.
de: %s: unlogische Optionen gesetzt
fr: %s : Liste d'options incohérente.

source: %s: --build-only cannot be used with --clean-cache
de: %s: »--build-only« kann nicht zusammen mit »--clean-cache« benutzt werden
fr: %s : --build-only ne peut pas être utilisé avec --clean-cache

source: %s: Cleaning %s*
de: %s: %s* wird bereinigt
fr: %s : Nettoyage de %s*

source: %s: Done.
de: %s: erledigt
fr: %s : Terminé.

source: ERROR: Please specify some packages for %s to convert.
de: FEHLER: Geben Sie bitte einige Pakete für %s zum Umwandeln an.
fr: ERREUR : Veuillez indiquer les paquets à convertir par %s.

source: ERROR: %s: misconfiguration, '%s' missing.
de: FEHLER: %s: falsche Konfiguration, »%s« fehlt.
fr: ERREUR : %s : mauvaise configuration, « %s » manquant.

source: Cannot open sources list
de: Quellenliste kann nicht geöffnet werden.
fr: Impossible d'ouvrir la liste des sources

source: Cannot read
de: kann nicht gelesen werden
fr: Impossible de lire

source: INF: Checking against currently installed cross packages....
de: INFO: Es wird geprüft, ob aktuell Cross-Pakete installiert sind …
fr: INF : Vérification des paquets croisés actuellement installés...

source: INF: Skipping installation of %s - newer or same version already installed (%s).
de: INFO: Installation von %s wird übersprungen – eine neuere oder gleiche Version ist bereits installiert (%s).
fr: INF : Abandon de l'installation de %s - une version identique ou plus récente est déjà installée (%s).

source: cannot open apt sources list.
de: Apt-Quellenliste kann nicht geöffnet werden.
fr: Impossible d'ouvrir la liste des sources d'apt.

source: cannot open apt sources.list directory
de: Apt-Verzeichnis mit sources.list kann nicht geöffnet werden.
fr: Impossible d'ouvrir le répertoire sources.list d'apt.

source: %s version %s Usage: %s [-M|--mirror] [-S|--suite] [-k|--keep-cache] PACKAGES ... %s -c|--clean-cache %s -?|-h|--help|--version Commands: -c|--clean-cache: Remove any downloaded cache files and exit. Options: -b|--build-only: Get and process the packages, do not install (implies -k) -M|--mirror: A Debian mirror with the requested package(s) -S|--suite: Which suite to use for the package(s) -k|--keep-cache: Preserve the downloaded cache files to use again. -a|--arch ARCHITECTURE: Specify the architecture to download or install. --ignore-status: Ignore currently installed packages (native) --check-newer: Check if the same or newer version of the cross package is installed and skip installation. -m|--multiarch: Convert Multi-Arch packages to old dpkg-cross paths. Requires dpkg-cross (>= %s) xapt tidies up after itself by removing all temporary data and packages after installation, unless the --keep-cache option is used. (Converted packages are not preserved.) The archives will be downloaded into /var/lib/xapt/archives/ before being converted with dpkg-cross and installed using dpkg. Using --build-only implies --keep-cache. Converted packages are created in /var/lib/xapt/output/
de: %s-Version %s Aufruf: %s [-M|--mirror] [-S|--suite] [-k|--keep-cache] PAKETE ... %s -c|--clean-cache %s -?|-h|--help|--version Befehle: -c|--clean-cache: alle heruntergeladenen Zwischenspeicherdateien entfernen und beenden Optionen: -b|--build-only: die Pakete abrufen und verarbeiten, aber nicht installieren (impliziert -k) -M|--mirror: ein Debian-Spiegel mit dem/den angeforderten Paket(en) -S|--suite: die Suite, die für das/die Paket(e) benutzt werden soll -k|--keep-cache: die heruntergeladenen Zwischenspeicherdateien zur erneuten Benutzung aufbewahren. -a|--arch ARCHITEKTUR: Angabe der Architektur, die heruntergeladen oder installiert werden soll --ignore-status: aktuell installierte Pakete (nativ) ignorieren --check-newer: prüfen, ob die gleiche oder eine neuere Version des Cross-Paketes installiert ist und die Installation überspringen -m|--multiarch: konvertiert Pakete für mehrere Architekturen auf alten Dpkg-cross-Pfade. Erfordert Dpkg-cross (>= %s) Xapt räumt hinterher selbst auf, indem es alle temporären Daten und Pakete nach der Installation entfernt, außer wenn die Option »--keep-cache« benutzt wird. (Umgewandelte Pakete werden nicht aufbewahrt.) Die Archive werden nach /var/lib/xapt/archives/ heruntergeladen, bevor sie mit Dpkg-cross umgewandelt und mit Dpkg installiert werden. Benutzen von »--build-only« impliziert »--keep-cache«. Umgewandelte Pakete werden in /var/lib/xapt/output/ erstellt.
fr: %s version %s Utilisation : %s [-M|--mirror] [-S|--suite] [-k|--keep-cache] PAQUETS … %s -c|--clean-cache %s -?|-h|--help|--version Commandes : -c|--clean-cache : Supprime le cache des fichiers téléchargés et quitte Options : -b|--build-only : Télécharge et traite les paquets, sans les installer (implique -k) -M|--mirror : Un miroir Debian avec le(s) paquet(s) requis -S|--suite : La distribution à utiliser pour le(s) paquet(s) -k|--keep-cache : Conserve le cache des fichiers téléchargés pour réutilisation ultérieure -a|--arch ARCHITECTURE : Indique l'architecture à télécharger ou installer --ignore-status : Ignore les paquets actuellement installés (nativement) --check-newer: Vérifie si une version identique ou plus récente du paquet croisé est installée et saute l'installation -m|--multiarch: Convertit les paquets Multi-Arch vers les anciens chemins de dpkg-cross. Nécessite dpkg-cross (>= %s) xapt nettoie après exécution en supprimant tous les paquets et les données temporaires après installation, sauf si l'option --keep-cache est utilisée. (Les paquets convertis ne sont pas conservés.) Les archives seront téléchargées dans /var/lib/xapt/archives/ avant d'être converties par dpkg-cross et installées avec dpkg. L'utilisation de --build-only implique --keep-cache. Les paquets convertis sont créés dans /var/lib/xapt/output/
