Repository: camiloaa/embdebian-crush
Catalog: doc/po/*.po
Languages: de, fr

source: emvendor - retrieve vendor-specific package configuration strings
de: emvendor - anbieterspezifische Paketkonfigurationszeichenketten abrufen
fr: emvendor - récupère les chaînes de configuration de paquet propres à l'éditeur

source: Synopsis
de: Übersicht

source: emvendor -V|--vendor VENDOR -p|--package PACKAGE -k|--key KEY emvendor -?|-h|--help|--version
de: emvendor -V|--vendor ANBIETER -p|--package PAKET -k|--key SCHLÜSSEL emvendor -?|-h|--help|--version
fr: emvendor -V|--vendor ÉDITEUR -p|--package PAQUET -k|--key CLÉ emvendor -?|-h|--help|--version

source: Commands
de: Befehle
fr: Commandes

source: -v|--vendor VENDOR: the vendor name from dpkg-vendor -p|--package PACKAGE: the package name (usually source) -k|--key KEY: arbitrary string for the key of the data
de: -v|--vendor ANBIETER: der Anbietername aus dpkg-vendor -p|--package PAKET: der Paketname (normalerweise Quelle) -k|--key SCHLÜSSEL: beliebige Zeichenkette für den Schlüssel der Daten
fr: -v|--vendor ÉDITEUR: le nom de l'éditeur obtenu par dpkg-vendor -p|--package PAQUET: le nom du paquet (habituellement source) -k|--key CLÉ: chaîne arbitraire pour la clé des données

source: All commands must be specified every time.
de: Alle Befehle müssen jedesmal angegeben werden.
fr: Toutes les commandes doivent être indiquées à chaque exécution.

source: On success, the string is printed and emvendor exits with zero.
de: Bei Erfolg wird die Zeichenkette ausgegeben und emvendor mit dem Rückgabewert Null beendet.
fr: En cas de succès, la chaîne de caractères est affichée et emvendor retourne zéro.

source: In the case of error, emvendor dies with an empty string on STDERR and exits with a non-zero return value.
de: Im Fall eines Fehlers wird emvendor mit einer leeren Zeichenkette auf der Standardfehlerausgabe und mit einem Rückgabewert ungleich Null beendet.
fr: En cas d'erreur, emvendor se termine avec une chaîne vide sur STDERR et renvoie une valeur différente de zéro.

source: Description
de: Beschreibung

source: emvendor provides a way for debian/rules to call in a string for a particular package that fits into the rules for that package B<and> conforms to the requirements of the vendor.
de: emvendor stellt eine Möglichkeit für debian/rules bereit, eine Zeichenkette für ein bestimmtes Paket abzurufen, die in die Regeln dieses Pakets passt B<und> den Anforderungen des Anbieters entspricht.
fr: emvendor permet à debian/rules de récupérer, pour un paquet précis, une chaîne de caractères qui s'intègre aux règles pour ce paquet B<et> qui est conforme aux conditions de l'éditeur (« vendor »).

source: It is fairly obvious that specifying each vendor in the F<debian/rules> file of each package is not going to be particularly flexible.
de: Es ist ziemlich offensichtlich, dass die Angabe jedes Anbieters in der Datei F<debian/rules> von jedem Paket nicht besonders flexibel sein wird.
fr: Il est assez évident qu'indiquer chaque éditeur dans le fichier F<debian/rules> pour chaque paquet ne va pas être particulièrement flexible.

source: DEB_VENDOR=$(shell dpkg-vendor --query vendor) ifeq (Debian,$(DEB_VENDOR)) # Debian build EXCONFARGS=--disable-mono --disable-monodoc else # any-vendor build EXCONFARGS=$(shell emvendor --vendor $(DEB_VENDOR) --package avahi --key EXCONFARGS) endif
de: DEB_VENDOR=$(shell dpkg-vendor --query vendor) ifeq (Debian,$(DEB_VENDOR)) # Debian-Build EXCONFARGS=--disable-mono --disable-monodoc else # Build aller Anbieter EXCONFARGS=$(shell emvendor --vendor $(DEB_VENDOR) --package avahi --key EXCONFARGS) endif

source: or use the short options:
de: oder benutzen Sie die Kurzoptionen:
fr: ou utiliser les options courtes :

source: The values themselves are in a vendor-specific conf file in F</etc/emvendor.d/>
de: Die Werte selbst liegen in einer anbieterspezifischen Konfigurationsdatei in F</etc/emvendor.d/>
fr: Les valeurs elles-mêmes sont dans un fichier de configuration spécifique à l'éditeur dans F</etc/emvendor.d/>

source: (Note that the value has to be all on one line which is a little awkward - also note that values are not able to include the equals sign which could be more of an issue.)
de: (Beachten Sie, dass der Wert ganz in einer Zeile stehen muss, was etwas ungeschickt ist – beachten Sie außerdem, dass Werte nicht das Gleichheitszeichen enthalten dürfen, was eher ein Problem sein könnte.)
fr: (À noter : la valeur doit être sur une seule ligne, ce qui est peu commode - à noter également : les valeurs ne peuvent pas contenir le signe égal ce qui peut être plus gênant.)

source: Packages that need two strings can do so - the key string is entirely arbitrary as long as it fits in the style of a typical ini file.
de: Pakete, die zwei Zeichenketten benötigen, können das so tun – die Schlüsselzeichenkette ist völlig beliebig, solange sie in den Stil einer typischen Ini-Datei passt.
fr: Les paquets qui nécessitent deux chaînes peuvent faire ainsi - la chaîne « clé » est complètement arbitraire tant qu'elle correspond au style d'un fichier « ini » typique.

source: Therefore, the key can be matched to the needs of the relevant package.
de: Daher kann der Schlüssel an die Bedürfnisse des maßgeblichen Pakets angepasst werden.
fr: Par conséquent, la clé peut être adaptée aux besoins du paquet concerné.

source: C<emdebian-buildsupport> provides F</etc/emvendor.d/emdebian-crush> with all the content for all packages that need such details.
de: C<emdebian-buildsupport> stellt F</etc/emvendor.d/emdebian-crush> mit all dem Inhalt allen Paketen bereit, die solche Einzelheiten benötigen.
fr: C<emdebian-buildsupport> renseigne F</etc/emvendor.d/emdebian-crush> avec tout le contenu pour tous les paquets qui nécessitent de tels détails.

source: emvendor and dpkg-vendor
de: emvendor und dpkg-vendor
fr: emvendor et dpkg-vendor

source: F<dpkg-vendor> supports vendor functionality but F<emvendor> adds an extra hierarchy, organised by Debian source package name. It would be possible to include the relevant strings in F</etc/dpkg/origins/vendor> but each identifier string would need to be unique across all packages for each vendor, which is an unrealistic limitation.
de: F<dpkg-vendor> unterstützt Anbieterfunktionalität, aber F<emvendor> fügt eine zusätzliche Hierarchie ein, die nach Debian-Quellpaketnamen organisiert wird. Es wäre möglich, alle maßgeblichen Zeichenketten in F</etc/dpkg/origins/vendor> einzufügen, aber jeder Bezeichner müsste über alle Pakete hinweg für jeden Anbieter einmalig sein, was eine unrealistische Einschränkung ist.
fr: F<dpkg-vendor> gère la fonctionnalité des éditeurs mais F<emvendor> ajoute une hiérarchie supplémentaire, organisée par nom de paquet Debian source. Il serait possible d'inclure les chaînes correspondantes dans F</etc/dpkg/origins/éditeur> mais chaque chaîne de l'identifiant devrait être unique parmi tous les paquets pour chaque éditeur, ce qui est une contrainte irréaliste.

source: pdebuild-cross - simple pbuilder wrapper for crossbuild support
de: pdebuild-cross - einfacher pbuilder-Wrapper für Cross-Build-Unterstützung
fr: pdebuild-cross - simple encapsulation de pbuilder pour la construction croisée

source: pdebuild-cross [pbuilder options]
de: pdebuild-cross [pbuilder-Optionen]
fr: pdebuild-cross [options pbuilder]

source: C<pdebuild-cross> wraps pdebuild to support cross-building inside a pbuilder chroot. C<pdebuild-cross> needs to be run in the top level source directory of the package (where it can find F<debian/changelog>).
de: C<pdebuild-cross> umgibt PDEBuild, um Cross-Build innerhalb einer pbuilder-Chroot zu unterstützen. C<pdebuild-cross> muss auf der obersten Ebene des Quellverzeichnisses des Pakets ausgeführt werden (wo es F<debian/changelog> finden kann).
fr: C<pdebuild-cross> encapsule pdebuild pour la gestion de la construction croisée dans un chroot pbuilder. C<pdebuild-cross> doit être exécuté dans le répertoire de plus haut niveau des sources du paquet (où il peut trouver F<debian/changelog>).

source: Options
de: Optionen

source: C<pdebuild-cross> supports no options itself, any options specified will be passed untouched to F<pdebuild --debbuildopts options>.
de: C<pdebuild-cross> unterstützt selbst keine Optionen, jegliche angegebenen Optionen werden unverändert an F<pdebuild --debbuildopts Optionen> weitergereicht.
fr: C<pdebuild-cross> ne gère aucune option propre ; toutes les options indiquées seront passées sans modification à F<pdebuild --debbuildopts options>.

source: Architecture
de: Architektur

source: F</etc/pdebuild-cross/pdebuild-cross.rc> defaults to C<armel> - edit the F</etc/pdebuild-cross/pdebuild-cross.rc> configuration file to change the architecture. See also F<pdebuild-cross-create> (1)
de: Vorgabe für F</etc/pdebuild-cross/pdebuild-cross.rc> ist C<armel> – bearbeiten Sie die Konfigurationsdatei F</etc/pdebuild-cross/pdebuild-cross.rc>, um dieArchitektur zu ändern. Siehe auch F<pdebuild-cross-create> (1)
fr: F</etc/pdebuild-cross/pdebuild-cross.rc> prend par défaut la valeur C<armel> - éditer le fichier de configuration F</etc/pdebuild-cross/pdebuild-cross.rc> pour changer l'architecture. Voir aussi F<pdebuild-cross-create> (1)

source: Creating the chroot
de: Die Chroot erstellen
fr: Création du chroot

source: Use C<pdebuild-cross-create> to build a suitable chroot tgz using multistrap.
de: Benutzen Sie C<pdebuild-cross-create>, um unter Benutzung von multistrap ein geeignetes Chroot-Tgz zu erstellen.
fr: Utiliser C<pdebuild-cross-create> pour construire un tgz de chroot adapté en utilisant multistrap.

source: pdebuild-cross-create - pbuilder wrapper to create a crossbuild chroot
de: pdebuild-cross-create - pbuilder-Wrapper zum Erstellen einer Cross-Build-Chroot
fr: pdebuild-cross-create - encapsulation de pbuilder pour créer un chroot de construction croisée

source: C<pdebuild-cross-create> supports no options. Edit the F</etc/pdebuild-cross/pdebuild-cross.rc> configuration file to change how C<pdebuild-cross-create> behaves.
de: C<pdebuild-cross-create> unterstützt keine Optionen. Bearbeiten Sie die Konfigurationsdatei F</etc/pdebuild-cross/pdebuild-cross.rc>, um das Verhalten von C<pdebuild-cross-create> zu ändern.
fr: C<pdebuild-cross-create> ne gère aucune option. Éditer le fichier de configuration F</etc/pdebuild-cross/pdebuild-cross.rc> pour modifier le comportement de C<pdebuild-cross-create>.

source: F</etc/pdebuild-cross/pdebuild-cross.rc> defaults to C<armel> - edit the F</etc/pdebuild-cross/pdebuild-cross.rc> configuration file to change the architecture. Ensure that the C<MULTISTRAPFILE> configuration value is also modified to specify a C<multistrap> configuration file suitable for the architecture required.
de: Vorgabe für F</etc/pdebuild-cross/pdebuild-cross.rc> ist C<armel> – bearbeiten Sie die Konfigurationsdatei F</etc/pdebuild-cross/pdebuild-cross.rc>, um dieArchitektur zu ändern. Stellen Sie sicher, dass auch der Konfigurationswert C<MULTISTRAPFILE> geändert wird, um eine geeignete C<multistrap>-Konfigurationsdatei für die benötigte Architektur anzugeben.
fr: F</etc/pdebuild-cross/pdebuild-cross.rc> prend par défaut la valeur C<armel> - éditer le fichier de configuration F</etc/pdebuild-cross/pdebuild-cross.rc> pour changer d'architecture. Vérifier que la valeur du paramètre C<MULTISTRAPFILE> est modifiée pour indiquer un fichier de configuration C<multistrap> adapté à l'architecture requise.

source: However, the current pbuilder hooks also default to C<armel> and would need to be replaced for other architectures.
de: Vorgabe für die aktuellen pbuilder-Hooks ist jedoch ebenfalls C<armel> und es wäre nötig, es für andere Architekturen zu ersetzen.
fr: Cependant, les points d'entrée (« hooks ») actuels de pbuilder prennent également par défaut la valeur C<armel> et devraient être remplacés pour d'autres architectures.

source: pdebuild-cross-update - pbuilder wrapper to update a crossbuild chroot
de: pdebuild-cross-update - pbuilder-Wrapper, um eine Cross-Build-Chroot zu aktualisieren
fr: pdebuild-cross-update - encapsulation de pbuilder pour mettre à jour un chroot de construction croisée

source: Simply wraps C<pbuilder update> to use the F<pdebuild-cross> tarball.
de: umgibt einfach C<pbuilder update>, um den F<pdebuild-cross>-Tarball zu benutzen.
fr: Encapsule tout simplement C<pbuilder update> pour utiliser l'archive tar de F<pdebuild-cross>

source: C<pdebuild-cross-update> supports no options. Edit the F</etc/pdebuild-cross/pdebuild-cross.rc> configuration file to change the tarball to update.
de: C<pdebuild-cross-update> unterstützt keine Optionen. Bearbeiten Sie die Konfigurationsdatei F</etc/pdebuild-cross/pdebuild-cross.rc>, um den Tarball zu ändern, der aktualisiert werden soll.
fr: C<pdebuild-cross-update> ne gère aucune option. Éditer le fichier de configuration F</etc/pdebuild-cross/pdebuild-cross.rc> pour changer l'archive tar à mettre à jour.

source: svn-pdebuild-cross - simple svn-buildpackage wrapper for crossbuild support
de: svn-pdebuild-cross - einfacher svn-suildpackage-Wrapper für Cross-Build-Unterstützung
fr: svn-pdebuild-cross - simple encapsulation de svn-buildpackage pour la construction croisée

source: svn-pdebuild-cross [svn-buildpackage options]
de: svn-pdebuild-cross [svn-buildpackage-Optionen]
fr: svn-pdebuild-cross [options svn-buildpackage]

source: C<svn-pdebuild-cross> wraps svn-buildpackage to support cross-building inside a pbuilder chroot. C<svn-pdebuild-cross> needs to be run in the top level source directory of the package (where it can find F<debian/changelog>).
de: C<svn-pdebuild-cross> umgibt svn-buildpackage, um Cross-Build innerhalb einer pbuilder-Chroot zu unterstützen. C<svn-pdebuild-cross> muss auf der obersten Ebene des Quellverzeichnisses des Pakets ausgeführt werden (wo es F<debian/changelog>) finden kann.
fr: C<svn-pdebuild-cross> encapsule svn-buildpackage pour gérer la construction croisée dans un chroot pbuilder. C<svn-pdebuild-cross> doit être exécuté dans le répertoire de plus haut niveau des sources du paquet (où il peut trouver F<debian/changelog>).

source: The script is a little (but just a little) more than an alias for:
de: Das Skript ist ein wenig (aber nur ein wenig) mehr als ein Alias für:
fr: Le script est un peu (mais à peine) plus qu'un alias pour :

source: C<svn-pdebuild-cross> supports no options itself, any options specified will be passed untouched to F<svn-buildpackage>.
de: C<svn-pdebuild-cross> unterstützt selbst keine Optionen. Jegliche angegebenen Optionen werden unverändert an F<svn-buildpackage> weitergereicht.
fr: C<svn-pdebuild-cross> ne gère aucune option propre : toutes les options indiquées seront passées sans modification à F<svn-buildpackage>.

source: xapt - convert Debian packages to cross versions on-the-fly
de: xapt - wandelt Debian-Pakete direkt in Cross-Versionen um
fr: xapt - convertir à la volée des paquets Debian en versions croisées

source: Downloading the Packages files can take a reasonable amount of time, so to grip a number of packages, either specify all packages in one command or use the C<--keep-cache> option for each run and use the C<--clean-cache> option at the end.
de: Das Herunterladen der Packages-Dateien kann eine angemessene Zeit in Anspruch nehmen, geben Sie daher entweder alle Pakete in einem Befehl an oder benutzen Sie für jeden Durchgang die Option C<--keep-cache> und am Ende die Option C<--clean-cache>.
fr: Le téléchargement des fichiers « Packages » peut prendre un certain temps ; pour récupérer plusieurs paquets, il est préférable soit d'indiquer tous les paquets dans une seule commande, soit d'utiliser l'option C<--keep-cache> à chaque exécution et d'utiliser l'option C<--clean-cache> à la fin.

source: Note also that, in common with the rest of Emdebian processing, Install-Recommends is always turned off, so if you need a package that is only recommended by packages in the list given to C<xapt>, that package will need to be added to the list explicitly.
de: Beachten Sie außerdem, dass Install-Recommends, ebenso wie der Rest der Emdebian-Verarbeitung, immer ausgeschaltet ist. Falls Sie also ein Paket benötigen, das von Paketen in der Liste nur empfohlen wird, die C<xapt> gegeben wurde, ist es nötig, dieses Paket explizit zur Liste hinzuzufügen.
fr: À noter également : comme pour le reste des traitements d'Emdebian, Install-Recommends est toujours désactivé. C'est pourquoi, si un paquet à traiter est seulement recommandé par des paquets dans la liste passée à C<xapt>, il faut indiquer explicitement ce paquet dans la liste.

source: Limitations
de: Einschränkungen

source: Installing any package from repositories outside the normal apt sources (especially if those packages are subsequently modified by dpkg-cross) will list those packages as "local or obsolete" in package managers. Converted packages cannot be upgraded without repeating the call to C<xapt> because C<apt-get> does not know about the renaming of the package by C<dpkg-cross> when downloading the packages. This can cause problems if dependencies of such packages need to be upgraded. It is possible that the main system C<apt> will try to remove these local packages in order to proceed with the main system upgrade.
de: Die Installation von Paketen aus Depots außerhalb der normalen APT-Quellen (insbesondere, wenn diese Pakete nachfolgend durch dpkg-cross geändert wurden) wird diese Pakete in den Paketverwaltungsprogrammen als »lokal oder veraltet« aufführen. Für umgewandelte Pakete kann kein Upgrade durchgeführt werden ohne C<xapt> erneut aufzurufen, da C<apt-get> nichts vom Umbenennen des Pakets durch C<dpkg-cross> weiß, wenn die Pakete heruntergeladen werden. Dies kann Probleme verursachen, falls Upgrades für Abhängigkeiten solcher Pakete durchgeführt werden müssen. Es ist möglich, dass das Hauptsystem C<apt> versuchen wird, diese lokalen Pakete zu entfernen, um mit dem Upgrade des Hauptsystems fortzufahren.
fr: L'installation de paquets depuis des référentiels différents des sources normales d'apt (notamment si ces paquets sont modifiés par dpkg-cross par la suite) entraînera le statut « local ou obsolète » de ces paquets dans les gestionnaires de paquets. Les paquets convertis ne peuvent pas être mis à niveau sans répéter l'appel à C<xapt> car C<apt-get> n'est pas informé du renommage du paquet par C<dpkg-cross> lors du téléchargement des paquets. Cela peut poser des problèmes si des dépendances de ces paquets doivent être mises à niveau. Il est possible que l'C<apt> du système principal essaie de désinstaller ces paquets locaux pour effectuer une mise à niveau du système principal.

source: The best option is to use C<xapt> inside a disposable chroot.
de: Die beste Option besteht darin, C<xapt> innerhalb einer Wegwerf-Chroot zu benutzen.
fr: La meilleure solution consiste à utiliser C<xapt> à l'intérieur d'un chroot jetable.

source: Checking existing cross packages
de: Existierende Cross-Pakete prüfen
fr: Vérification des paquets croisés existants

source: C<xapt>, by default, will not check to see if a particular cross package is already installed at a newer or equal version which can cause cross packages to be downgraded. To turn on this check, either use the C<--check-newer> option or set C<checknewer> to true in the vendor configuration file in F</etc/xapt.d/>.
de: C<xapt> wird standardmäßig nicht prüfen, ob ein spezielles Cross-Paket bereits in einer neueren oder gleichen Version installiert ist, was dazu führen kann, dass ein Downgrade von Cross-Paketen durchgeführt wird. Um diese Prüfung einzuschalten, benutzen Sie entweder die Option C<--check-newer> oder setzen die Option C<checknewer> in der Anbieterkonfigurationsdatei in F</etc/xapt.d/> auf »true«.
fr: C<xapt> ne vérifiera pas par défaut si un paquet croisé donné est déjà installé dans une version plus récente ou identique, ce qui peut entraîner un abaissement de niveau (« downgrade ») de paquets croisés. Pour activer cette vérification, il faut soit utiliser l'option C<--check-newer>, soit valoriser C<checknewer> à « true » dans le fichier de configuration de l'éditeur dans F</etc/xapt.d/>.

source: Using SecureApt
de: SecureApt benutzen
fr: Utilisation de SecureApt

source: If your apt sources include a repository which does not use SecureApt, disable authentication in the vendor configuration file in F</etc/xapt.d/> Set noauth=true.
de: Falls Ihre APT-Quellen ein Depot enthalten, das SecureApt nicht benutzt, deaktivieren Sie die Authentifizierung in der Anbieterkonfigurationsdatei in F</etc/xapt.d/>
fr: Si les sources d'apt contiennent un référentiel qui n'utilise pas SecureApt, désactiver l'authentification dans le fichier de configuration de l'éditeur dans F</etc/xapt.d/> : Set noauth=true.

source: Multiarch behaviour
de: Multiarch-Verhalten
fr: Comportement multi-architecture

source: By default <dpkg-cross> does nothing with packages from Debian which already support Multi-Arch - the package is simply copied to the current work directory, if it does not already exist. Any package containing a Multi-Arch: field in DEBIAN/control is skipped in this manner.
de: Standardmäßig tut <dpkg-cross> nichts mit Paketen von Debian, die bereits Multiarch unterstützen – das Paket wird einfach ins aktuelle Arbeitsverzeichnis kopiert, falls es nicht bereits existiert. Jedes Paket, das ein Feld »Multi-Arch:« in DEBIAN/control enthält, wird auf diese Art übersprungen.
fr: Par défaut, <dpkg-cross> ne fait rien avec les paquets Debian qui supportent déjà « Multi-Arch » ; les paquets sont seulement copiés dans le répertoire de travail courant, s'ils n'existent pas déjà. Tout paquet dont le fichier DEBIAN/control contient un champ « Multi-Arch: » est ainsi ignoré.

source: C<xapt> uses the --multiarch option can pass the --convert-multiarch option down to dpkg-cross to instead force the generation of a -<arch>-cross package with the files moved into the conventional dpkg-cross locations.
de: C<xapt> kann durch Benutzen der Option --multiarch die Option --convert-multiarch an dpkg-cross weitergeben, anstatt das Erstellen eines -<arch>-cross-Pakets zu erzwingen, bei dem die Dateien an herkömmliche Speicherorte von dpkg-cross verschoben werden.
fr: C<xapt>, avec l'option --multiarch, passe l'option --convert-multiarch à dpkg-cross pour forcer à la place la génération d'un paquet « -<arch>-cross » avec les fichiers déplacés dans les emplacements habituels de dpkg-cross.

source: C<xapt> will check for dpkg-cross version 2.6.3 or higher when this option is set and report an error (unsetting the option) if a suitable version is not found.
de: Wenn diese Option gesetzt ist, wird C<xapt> prüfen, ob die Version von dpkg-cross 2.6.3 oder höher ist und einen Fehler melden (diese Option abschalten), falls keine geeignete Version gefunden wurde.
fr: C<xapt> vérifiera que la version de dpkg-cross est bien supérieure ou égale à 2.6.3 lorsque cette option est passée, et affichera une erreur (et désactivera l'option) si aucune version correspondante n'est trouvée.

source: embuilddeps - handle native and cross build-dependency installation.
de: embuilddeps - handhabt die Installation von systemeigenen und Cross-Build-Abhängigkeiten
fr: embuilddeps - gérer l'installation de dépendances de construction natives et croisées

source: Usage
de: Aufruf
fr: Utilisation
