Repository: camiloaa/embdebian-crush
Catalog: doc/po/*.po
Languages: de, fr

source: -a|--arch: Install cross packages for the specified arch. -d|--dir DIR: Location of the unpacked source (./debian/control) --dsc DSCFILE: Path to a .dsc file for the package. -m|--multiarch: Make dpkg-cross convert Multi-Arch packages. -k|--preserve: Pass the -k option down to xapt. -v|--verbose: Make the output more verbose -q|--quiet: Make the output less verbose -n|--dry-run: Only output the commands which would be used. --use-sudo: Call apt-get using sudo.
de: -a|--arch: Cross-Pakete für die angegebene Architektur installieren -d|--dir DIR: Speicherort der nicht gepackten Quelle (./debian/control) --dsc DSCFILE: Pfad zu einer .dsc-Datei für das Paket -m|--multiarch: dpkg-cross Multiarch-Pakete umwandeln lassen -k|--preserve: die Option -k an xapt weitergeben -v|--verbose: detailreichere Ausgabe -q|--quiet: detailärmere Ausgabe -n|--dry-run: nur die Befehle ausgeben, die benutzt würden --use-sudo: apt-get unter Benutzung von sudo aufrufen.
fr: -a|--arch: Installe les paquets croisés pour l'architecture indiquée -d|--dir DIR: Emplacement des sources non-empaquetées (./debian/control) --dsc DSCFILE: Chemin d'un fichier .dsc pour le paquet -m|--multiarch: Active la conversion des paquets Multi-Arch par dpkg-cross -k|--preserve: Passe l'option -k à xapt -v|--verbose: Active la sortie détaillée -q|--quiet: Active la sortie silencieuse -n|--dry-run: Affiche les commandes qui seraient utilisées sans les exécuter --use-sudo: Appelle apt-get en utilisant sudo

source: C<embuilddeps> is a simple build dependency checker for cross-building. Native build dependencies are checked using the F<debian/control> file in the source package being built and installed with C<apt-get>.
de: C<embuilddeps> ist ein einfaches Programm, das Cross-Build-Abhängigkeiten prüft. Systemeigene Build-Abhängigkeiten werden unter Benutzung der Datei F<debian/control> im Quellpaket geprüft, das mit C<apt-get> gebaut und installiert wird.
fr: C<embuilddeps> est un simple vérificateur de dépendances de construction pour la construction croisée. Les dépendances de construction natives sont vérifiées en utilisant le fichier F<debian/control> dans le paquet source en cours de construction et d'installation par C<apt-get>.

source: Cross build dependencies are checked using a F<debian/xcontrol> file or the F<debian/control> file if no xcontrol file exists.
de: Cross-Build-Abhängigkeiten werden unter Benutzung der Datei F<debian/control> geprüft oder, falls keine Xcontrol-Datei existiert, mit F<debian/control>.
fr: Les dépendances de construction croisée sont vérifiées en utilisant le fichier F<debian/xcontrol> ou le fichier F<debian/control> si le fichier xcontrol n'existe pas.

source: C<embuilddeps> uses C<xapt> to install cross build dependencies.
de: C<embuilddeps> benutzt C<xapt>, um Cross-Build-Abhängigkeiten zu installieren.
fr: C<embuilddeps> utilise C<xapt> pour installer les dépendances de construction croisée.

source: Output
de: Ausgabe
fr: Sortie

source: To see more about what is going on (and to check the results of parsing the dependencies and architecture limits.
de: Um mehr darüber zu erfahren, was vor sich geht (und die Ergebnisse der Auswertung von Abhängigkeiten und Architekturbeschränkungen zu prüfen):
fr: Pour observer ce qui se passe (et pour vérifier les résultats de l'analyse (« parsing ») des dépendances et des limites d'architecture).

source: See also Term::ANSIColor (3) for information on ANSI_COLORS_DISABLED.
de: Siehe auch Term::ANSIColor (3), um Informationen über ANSI_COLORS_DISABLED zu erhalten
fr: Voir aussi Term::ANSIColor (3) pour des informations sur ANSI_COLORS_DISABLED.

source: C<embuilddeps> can be used as a native and cross-dependency resolver in a pbuilder chroot using C<pbuilder>, C<pdebuild> or C<pdebuild-cross> and supports pbuilder options to locate the chroot and execute calls within the chroot.
de: C<embuilddeps> kann als systemeigener Auflöser von Cross-Abhängigkeiten in einer pbuilder-Chroot benutzt werden, der C<pbuilder>, C<pdebuild> oder C<pdebuild-cross> verwendet und die pbuilder-Optionen zum Finden der Chroot und zum Ausführen von Aufrufen innerhalb der Chroot unterstützt.
fr: C<embuilddeps> peut être utilisé en tant que solveur de dépendances natives et croisées dans un chroot pbuilder en utilisant C<pbuilder>, C<pdebuild> ou C<pdebuild-cross>. Il gère les options de pbuilder pour situer le chroot et effectuer des appels à l'intérieur du chroot.

source: --control indicates the location of the .dsc file --internal-chrootexec indicates the command to execute inside the chroot --chroot indicates the location of the chroot --binary-all is supported as a no-op by C<embuilddeps>.
de: --control zeigt den Speicherort der .dsc-Datei an --internal-chrootexec zeigt den Befehl an, der innerhalb der Chroot ausgeführt werden soll --chroot zeigt den Speicherort der Chroot an --binary-all wird von C<embuilddeps> als Leerbefehl unterstützt
fr: --control indique l'emplacement du fichier .dsc --internal-chrootexec indique la commande à exécuter dans le chroot --chroot indique l'emplacement du chroot --binary-all est pris en charge par C<embuilddeps> mais ne fait rien.

source: If other build tools need particular options to be supported, please file a wishlist bug against C<xapt> and describe the exact options which are necessary.
de: Falls andere Build-Werkzeuge die Unterstützung bestimmter Optionen erfordern, reichen Sie bitte einen Fehlerbericht mit Schweregrad »wishlist« auf Englisch gegen C<xapt> ein und beschreiben Sie, welche Optionen genau nötig sind.
fr: Si d'autres outils de construction nécessitent la prise en charge d'options particulières, veuillez soumettre un rapport de bogue de gravité « liste de souhaits » (« wishlist ») pour le paquet C<xapt> et décrire précisément les options nécessaires.

source: C<embuilddeps> does require that C<xapt> is installed inside the chroot - it will try to install it for you but it is much easier if you install it once and for all. C<pdebuild-cross> will add C<xapt> when creating a new chroot. See pdebuild-cross (1) for more information on how to manipulate a pdebuild-cross chroot after creation.
de: C<embuilddeps> erfordert, dass C<xapt> innerhalb der Chroot installiert ist – es wird versuchen, es für Sie zu installieren, aber es ist wesentlich leichter, wenn Sie es einmal und für alles installieren. Lesen Sie pdebuild-cross (1), um zu erfahren, wie eine pdebuild-cross-Chroot nach dem Erstellen manipuliert wird.
fr: C<embuilddeps> ne nécessite pas que C<xapt> soit installé dans le chroot ; il essaiera de l'installer automatiquement mais il est bien plus simple de l'installer manuellement une fois pour toutes. C<pdebuild-cross> ajoutera C<xapt> lors de la création d'un nouveau chroot. Voir pdebuild-cross (1) pour plus d'informations sur la manipulation d'un chroot de pdebuild-cross après sa création.

source: Source packages and dsc files
de: Quellpakete und dsc-Dateien
fr: Paquets source et fichiers dsc

source: C<embuilddeps> can also parse the build dependencies of a package via the F<.dsc> file. The rest of the source package (the files listed in the F<.dsc>) do B<not> need to exist and the source does not need to have been unpacked. Use the C<embuilddeps --dsc FILE> option.
de: C<embuilddeps> kann außerdem die Build-Abhängigkeiten eines Pakets über die F<.dsc>-Datei auswerten. Der Rest des Quellpakets (die Dateien, die in der F<.dsc>-Datei aufgeführt sind) dürfen B<nicht> existieren und die Quelle darf nicht entpackt sein. Benutzen Sie die Option C<embuilddeps --dsc DATEI>.
fr: C<embuilddeps> peut également analyser les dépendances de construction d'un paquet via le fichier F<.dsc>. Le reste du paquet (les fichiers listés dans le F<.dsc>) n'est B<pas> nécessaire et les sources n'ont pas besoin d'être dépaquetées. Utiliser l'option C<embuilddeps --dsc FICHIER>.

source: The alternative method is to parse the F<./debian/control> file at the location specified by the C<--dir> option which defaults to the current working directory.
de: Die alternative Methode besteht darin, die Datei F<./debian/control> auszuwerten. Ihr Speicherort wird durch die Option C<--dir> angegeben und ist standardmäßig das aktuelle Arbeitsverzeichnis.
fr: L'autre méthode consiste à analyser le fichier F<./debian/control> à l'emplacement indiqué avec l'option C<--dir> qui prend pour valeur par défaut le répertoire de travail courant.

source: Multi-Arch transition
de: Multiarch-Übergang
fr: Transition Multi-Arch

source: Some packages already have multi-arch paths which dpkg-cross does not normally convert. This can cause missing dependencies when trying to install the converted packages. Use the C<--multiarch> option to C<embuilddeps> to pass this down to C<xapt> and hence to C<dpkg-cross>.
de: Einige Pakete haben bereits Multiarch-Pfade, die dpkg-cross normalerweise nicht umwandelt. Dies kann der Grund für fehlende Abhängigkeiten sein, wenn versucht wird, die umgewandelten Pakete zu installieren. Benutzen Sie für C<embuilddeps> die Option C<--multiarch>, um dies an C<xapt> und daher an C<dpkg-cross> weiterzugeben.
fr: Certains paquets ont déjà des chemins multi-architecture que dpkg-cross ne convertit habituellement pas. Cela peut entraîner des dépendances manquantes lors de l'installation de paquets convertis. Utiliser l'option C<--multiarch> de C<embuilddeps> pour la passer à C<xapt> et donc à C<dpkg-cross>.

source: Retaining downloaded binaries
de: Beibehalten heruntergeladener Programme
fr: Conserver les binaires téléchargés

source: C<embuilddeps> can pass the C<-k> option to C<xapt> to retain the foreign architecture packages downloaded by C<xapt> and the packages built using C<dpkg-cross>.
de: C<embuilddeps> kann die Option C<-k> an C<xapt> weitergeben, um die Pakete, die von C<xapt> für die fremde Architektur heruntergeladen wurden, beizubehalten und die Pakete mit C<dpkg-cross> zu bauen.
fr: C<embuilddeps> peut passer l'option C<-k> à C<xapt> pour conserver les paquets pour les autres architectures téléchargés par C<xapt> et les paquets construits avec C<dpkg-cross>.

source: Note that C<xapt> should be asked to clean up the downloaded files once these lists have been handled by calling the C<xapt -c> option which removes the contents of F</var/lib/xapt/*>.
de: Beachten Sie, dass C<xapt> angewiesen werden sollte, die heruntergeladenen Dateien aufzuräumen, sobald diese Listen durch Aufruf der Option C<xapt -c> verarbeitet wurden, wodurch der Inhalt von F</var/lib/xapt/*> entfernt wird.
fr: À noter : C<xapt> devrait être appelé pour nettoyer les fichiers téléchargés une fois que ces listes ont été gérées par l'appel de l'option C<xapt -c>, qui supprime le contenu de F</var/lib/xapt/*>.

source: Name
fr: Nom

source: NAME
fr: NOM
